Logging started at 2025-01-17-08-28-56 
 
============================================================ 
Choice number chosen: 1 
============================================================ 
 
 
============================================================ 
Command: "ipconfig" "/flushdns" 
Description: "Flushes and resets the contents of the DNS client resolver cache." 
============================================================ 
 
 
 
============================================================ 
Running command: "ipconfig" "/flushdns" 
============================================================ 
 

Windows IP Configuration

Successfully flushed the DNS Resolver Cache.
 
============================================================ 
End of execution. 
============================================================ 
 
 
============================================================ 
Choice number chosen: 2 
============================================================ 
 
 
============================================================ 
Command: "ipconfig" "/displaydns" 
Description: "Displays the contents of the DNS client resolver cache." 
============================================================ 
 
 
 
============================================================ 
Running command: "ipconfig" "/displaydns" 
============================================================ 
 

Windows IP Configuration

    1.80.28.172.in-addr.arpa
    ----------------------------------------
    Record Name . . . . . : 1.80.28.172.in-addr.arpa.
    Record Type . . . . . : 12
    Time To Live  . . . . : 448093
    Data Length . . . . . : 8
    Section . . . . . . . : Answer
    PTR Record  . . . . . : DESKTOP-NRVEPHN.mshome.net


    1.48.20.172.in-addr.arpa
    ----------------------------------------
    Record Name . . . . . : 1.48.20.172.in-addr.arpa.
    Record Type . . . . . : 12
    Time To Live  . . . . : 448093
    Data Length . . . . . : 8
    Section . . . . . . . : Answer
    PTR Record  . . . . . : DESKTOP-NRVEPHN.mshome.net


    desktop-nrvephn.mshome.net
    ----------------------------------------
    No records of type AAAA


    desktop-nrvephn.mshome.net
    ----------------------------------------
    Record Name . . . . . : DESKTOP-NRVEPHN.mshome.net
    Record Type . . . . . : 1
    Time To Live  . . . . : 448093
    Data Length . . . . . : 4
    Section . . . . . . . : Answer
    A (Host) Record . . . : 172.28.80.1


    Record Name . . . . . : DESKTOP-NRVEPHN.mshome.net
    Record Type . . . . . : 1
    Time To Live  . . . . : 448093
    Data Length . . . . . : 4
    Section . . . . . . . : Answer
    A (Host) Record . . . : 172.20.48.1


 
============================================================ 
End of execution. 
============================================================ 
 
 
============================================================ 
Choice number chosen: 3 
============================================================ 
 
 
============================================================ 
Command: "arp" "-a" 
Description: "Displays the ARP cache." 
============================================================ 
 
 
 
============================================================ 
Running command: "arp" "-a" 
============================================================ 
 

Interface: 192.168.18.232 --- 0xb
  Internet Address      Physical Address      Type
  192.168.18.1          f0-63-f9-eb-a3-f8     dynamic   
  192.168.18.9          00-f4-8d-a3-f9-0b     dynamic   
  192.168.18.51         3c-01-ef-47-4f-5e     dynamic   
  192.168.18.62         e4-b3-18-7c-73-c9     dynamic   
  192.168.18.86         4a-e5-41-c0-c9-9d     dynamic   
  192.168.18.98         48-89-e7-1f-44-74     dynamic   
  192.168.18.255        ff-ff-ff-ff-ff-ff     static    
  224.0.0.2             01-00-5e-00-00-02     static    
  224.0.0.22            01-00-5e-00-00-16     static    
  224.0.0.251           01-00-5e-00-00-fb     static    
  224.0.0.252           01-00-5e-00-00-fc     static    
  224.0.2.60            01-00-5e-00-02-3c     static    
  239.255.102.18        01-00-5e-7f-66-12     static    
  239.255.255.250       01-00-5e-7f-ff-fa     static    
  255.255.255.255       ff-ff-ff-ff-ff-ff     static    

Interface: 169.254.72.108 --- 0x11
  Internet Address      Physical Address      Type
  169.254.255.255       ff-ff-ff-ff-ff-ff     static    
  224.0.0.2             01-00-5e-00-00-02     static    
  224.0.0.22            01-00-5e-00-00-16     static    
  224.0.0.251           01-00-5e-00-00-fb     static    
  224.0.0.252           01-00-5e-00-00-fc     static    
  224.0.2.60            01-00-5e-00-02-3c     static    
  239.255.102.18        01-00-5e-7f-66-12     static    
  239.255.255.250       01-00-5e-7f-ff-fa     static    

Interface: 169.254.248.171 --- 0x19
  Internet Address      Physical Address      Type
  169.254.255.255       ff-ff-ff-ff-ff-ff     static    
  224.0.0.2             01-00-5e-00-00-02     static    
  224.0.0.22            01-00-5e-00-00-16     static    
  224.0.0.251           01-00-5e-00-00-fb     static    
  224.0.0.252           01-00-5e-00-00-fc     static    
  224.0.2.60            01-00-5e-00-02-3c     static    
  239.255.102.18        01-00-5e-7f-66-12     static    
  239.255.255.250       01-00-5e-7f-ff-fa     static    
 
============================================================ 
End of execution. 
============================================================ 
 
 
============================================================ 
Choice number chosen: 4 
============================================================ 
 
 
============================================================ 
Command: "netsh" "interface show interface" 
Description: "Displays the status of network adapters." 
============================================================ 
 
 
 
============================================================ 
Running command: "netsh" "interface show interface" 
============================================================ 
 

Admin State    State          Type             Interface Name
-------------------------------------------------------------------------
Disabled       Disconnected   Dedicated        VMware Network Adapter VMnet1
Disabled       Disconnected   Dedicated        VMware Network Adapter VMnet8
Enabled        Connected      Dedicated        Ethernet
Disabled       Disconnected   Dedicated        Wi-Fi
Enabled        Connected      Dedicated        vEthernet (Ethernet)
Enabled        Connected      Dedicated        vEthernet (Default Switch)

 
============================================================ 
End of execution. 
============================================================ 
 
 
============================================================ 
Choice number chosen: 5 
============================================================ 
 
 
============================================================ 
Command: "ipconfig" "/all" 
Description: "Displays the current network configuration." 
============================================================ 
 
 
 
============================================================ 
Running command: "ipconfig" "/all" 
============================================================ 
 

Windows IP Configuration

   Host Name . . . . . . . . . . . . : DESKTOP-NRVEPHN
   Primary Dns Suffix  . . . . . . . : 
   Node Type . . . . . . . . . . . . : Hybrid
   IP Routing Enabled. . . . . . . . : No
   WINS Proxy Enabled. . . . . . . . : No

Ethernet adapter vEthernet (Ethernet):

   Connection-specific DNS Suffix  . : 
   Description . . . . . . . . . . . : Hyper-V Virtual Ethernet Adapter
   Physical Address. . . . . . . . . : 00-15-5D-FD-B1-66
   DHCP Enabled. . . . . . . . . . . : No
   Autoconfiguration Enabled . . . . : Yes
   Link-local IPv6 Address . . . . . : fe80::a412:8cbc:57bb:5b81%17(Preferred) 
   Autoconfiguration IPv4 Address. . : 169.254.72.108(Preferred) 
   Subnet Mask . . . . . . . . . . . : 255.255.0.0
   Default Gateway . . . . . . . . . : 
   DHCPv6 IAID . . . . . . . . . . . : 285218141
   DHCPv6 Client DUID. . . . . . . . : 00-01-00-01-2B-C0-74-8D-08-8F-C3-03-BE-8A
   DNS Servers . . . . . . . . . . . : fec0:0:0:ffff::1%1
                                       fec0:0:0:ffff::2%1
                                       fec0:0:0:ffff::3%1
   NetBIOS over Tcpip. . . . . . . . : Enabled

Ethernet adapter vEthernet (Default Switch):

   Connection-specific DNS Suffix  . : 
   Description . . . . . . . . . . . : Hyper-V Virtual Ethernet Adapter #2
   Physical Address. . . . . . . . . : 00-15-5D-9E-7F-C6
   DHCP Enabled. . . . . . . . . . . : No
   Autoconfiguration Enabled . . . . : Yes
   Link-local IPv6 Address . . . . . : fe80::fe95:3ddc:244:faf0%25(Preferred) 
   Autoconfiguration IPv4 Address. . : 169.254.248.171(Preferred) 
   Subnet Mask . . . . . . . . . . . : 255.255.0.0
   Default Gateway . . . . . . . . . : 
   DHCPv6 IAID . . . . . . . . . . . : 419435869
   DHCPv6 Client DUID. . . . . . . . : 00-01-00-01-2B-C0-74-8D-08-8F-C3-03-BE-8A
   DNS Servers . . . . . . . . . . . : fec0:0:0:ffff::1%1
                                       fec0:0:0:ffff::2%1
                                       fec0:0:0:ffff::3%1
   NetBIOS over Tcpip. . . . . . . . : Enabled

Ethernet adapter Ethernet:

   Connection-specific DNS Suffix  . : 
   Description . . . . . . . . . . . : Killer E2600 Gigabit Ethernet Controller
   Physical Address. . . . . . . . . : 08-8F-C3-03-BE-8A
   DHCP Enabled. . . . . . . . . . . : Yes
   Autoconfiguration Enabled . . . . : Yes
   IPv6 Address. . . . . . . . . . . : 2407:d000:b:aef1:eee9:529:26e3:4f14(Preferred) 
   Temporary IPv6 Address. . . . . . : 2407:d000:b:aef1:559a:7ed5:1ce9:1f6d(Deprecated) 
   Temporary IPv6 Address. . . . . . : 2407:d000:b:aef1:e456:56c9:2f2f:3621(Preferred) 
   Link-local IPv6 Address . . . . . : fe80::3e26:40a:1668:a2b1%11(Preferred) 
   IPv4 Address. . . . . . . . . . . : 192.168.18.232(Preferred) 
   Subnet Mask . . . . . . . . . . . : 255.255.255.0
   Lease Obtained. . . . . . . . . . : Friday, January 17, 2025 7:52:28 AM
   Lease Expires . . . . . . . . . . : Friday, January 17, 2025 9:22:31 AM
   Default Gateway . . . . . . . . . : fe80::1%11
                                       192.168.18.1
   DHCP Server . . . . . . . . . . . : 192.168.18.1
   DHCPv6 IAID . . . . . . . . . . . : 252219331
   DHCPv6 Client DUID. . . . . . . . : 00-01-00-01-2B-C0-74-8D-08-8F-C3-03-BE-8A
   DNS Servers . . . . . . . . . . . : ::ffff:127.0.2.2
                                       ::ffff:127.0.2.3
                                       127.0.2.2
                                       127.0.2.3
   NetBIOS over Tcpip. . . . . . . . : Enabled
 
============================================================ 
End of execution. 
============================================================ 
 
 
============================================================ 
Choice number chosen: 6 
============================================================ 
 
 
============================================================ 
Command: "ping" "www.google.com" 
Description: "Pings the specified IP or domain." 
============================================================ 
 
 
 
============================================================ 
Running command: "ping" "www.google.com" 
============================================================ 
 

Pinging www.google.com [2404:6800:4009:803::2004] with 32 bytes of data:
Reply from 2404:6800:4009:803::2004: time=322ms 
Reply from 2404:6800:4009:803::2004: time=321ms 
Reply from 2404:6800:4009:803::2004: time=322ms 
Reply from 2404:6800:4009:803::2004: time=322ms 

Ping statistics for 2404:6800:4009:803::2004:
    Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
    Minimum = 321ms, Maximum = 322ms, Average = 321ms
 
============================================================ 
End of execution. 
============================================================ 
 
 
============================================================ 
Choice number chosen: 7 
============================================================ 
 
 
============================================================ 
Command: "ipconfig" "/release" 
Description: "Releases the IP address." 
============================================================ 
 
 
 
============================================================ 
Running command: "ipconfig" "/release" 
============================================================ 
 

Windows IP Configuration


Ethernet adapter vEthernet (Ethernet):

   Connection-specific DNS Suffix  . : 
   Link-local IPv6 Address . . . . . : fe80::a412:8cbc:57bb:5b81%17
   Autoconfiguration IPv4 Address. . : 169.254.72.108
   Subnet Mask . . . . . . . . . . . : 255.255.0.0
   Default Gateway . . . . . . . . . : 

Ethernet adapter vEthernet (Default Switch):

   Connection-specific DNS Suffix  . : 
   Link-local IPv6 Address . . . . . : fe80::fe95:3ddc:244:faf0%25
   Autoconfiguration IPv4 Address. . : 169.254.248.171
   Subnet Mask . . . . . . . . . . . : 255.255.0.0
   Default Gateway . . . . . . . . . : 

Ethernet adapter Ethernet:

   Connection-specific DNS Suffix  . : 
   IPv6 Address. . . . . . . . . . . : 2407:d000:b:aef1:eee9:529:26e3:4f14
   Temporary IPv6 Address. . . . . . : 2407:d000:b:aef1:559a:7ed5:1ce9:1f6d
   Temporary IPv6 Address. . . . . . : 2407:d000:b:aef1:e456:56c9:2f2f:3621
   Link-local IPv6 Address . . . . . : fe80::3e26:40a:1668:a2b1%11
   Default Gateway . . . . . . . . . : fe80::1%11
 
============================================================ 
End of execution. 
============================================================ 
 
 
============================================================ 
Command: "ipconfig" "/renew" 
Description: "Renews the IP address." 
============================================================ 
 
 
 
============================================================ 
Running command: "ipconfig" "/renew" 
============================================================ 
 

Windows IP Configuration


Ethernet adapter vEthernet (Ethernet):

   Connection-specific DNS Suffix  . : 
   Link-local IPv6 Address . . . . . : fe80::a412:8cbc:57bb:5b81%17
   Autoconfiguration IPv4 Address. . : 169.254.72.108
   Subnet Mask . . . . . . . . . . . : 255.255.0.0
   Default Gateway . . . . . . . . . : 

Ethernet adapter vEthernet (Default Switch):

   Connection-specific DNS Suffix  . : 
   Link-local IPv6 Address . . . . . : fe80::fe95:3ddc:244:faf0%25
   Autoconfiguration IPv4 Address. . : 169.254.248.171
   Subnet Mask . . . . . . . . . . . : 255.255.0.0
   Default Gateway . . . . . . . . . : 

Ethernet adapter Ethernet:

   Connection-specific DNS Suffix  . : 
   IPv6 Address. . . . . . . . . . . : 2407:d000:b:aef1:eee9:529:26e3:4f14
   Temporary IPv6 Address. . . . . . : 2407:d000:b:aef1:559a:7ed5:1ce9:1f6d
   Temporary IPv6 Address. . . . . . : 2407:d000:b:aef1:e456:56c9:2f2f:3621
   Link-local IPv6 Address . . . . . : fe80::3e26:40a:1668:a2b1%11
   IPv4 Address. . . . . . . . . . . : 192.168.18.232
   Subnet Mask . . . . . . . . . . . : 255.255.255.0
   Default Gateway . . . . . . . . . : fe80::1%11
                                       192.168.18.1
 
============================================================ 
End of execution. 
============================================================ 
 
 
============================================================ 
Choice number chosen: 7 
============================================================ 
 
 
============================================================ 
Command: "ipconfig" "/release" 
Description: "Releases the IP address." 
============================================================ 
 
 
Skipping command: "ipconfig" "/release" 
Command skipped. 
 
============================================================ 
Command: "ipconfig" "/renew" 
Description: "Renews the IP address." 
============================================================ 
 
 
Skipping command: "ipconfig" "/renew" 
Command skipped. 
 
============================================================ 
Choice number chosen: 8 
============================================================ 
 
 
============================================================ 
Command: "netsh" "int ip reset" 
Description: "Resets TCP/IP stack (IPv4)." 
============================================================ 
 
 
 
============================================================ 
Running command: "netsh" "int ip reset" 
============================================================ 
 
Resetting Compartment Forwarding, OK!
Resetting Compartment, OK!
Resetting Control Protocol, OK!
Resetting Echo Sequence Request, OK!
Resetting Global, OK!
Resetting Interface, failed.
The requested operation requires elevation (Run as administrator).
Resetting Anycast Address, OK!
Resetting Multicast Address, OK!
Resetting Unicast Address, OK!
Resetting Neighbor, OK!
Resetting Path, OK!
Resetting Potential, OK!
Resetting Prefix Policy, OK!
Resetting Proxy Neighbor, OK!
Resetting Route, OK!
Resetting Site Prefix, OK!
Resetting Subinterface, OK!
Resetting Wakeup Pattern, OK!
Resetting Resolve Neighbor, OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Restart the computer to complete this action.

 
============================================================ 
End of execution. 
============================================================ 
 
 
============================================================ 
Choice number chosen: 9 
============================================================ 
 
 
============================================================ 
Command: "netsh" "int ipv6 reset" 
Description: "Resets TCP/IP stack (IPv6)." 
============================================================ 
 
 
 
============================================================ 
Running command: "netsh" "int ipv6 reset" 
============================================================ 
 
Resetting Compartment Forwarding, OK!
Resetting Compartment, OK!
Resetting Control Protocol, OK!
Resetting Echo Sequence Request, OK!
Resetting Global, OK!
Resetting Interface, OK!
Resetting Anycast Address, OK!
Resetting Multicast Address, OK!
Resetting Unicast Address, OK!
Resetting Neighbor, OK!
Resetting Path, OK!
Resetting Potential, OK!
Resetting Prefix Policy, OK!
Resetting Proxy Neighbor, OK!
Resetting Route, OK!
Resetting Site Prefix, OK!
Resetting Subinterface, OK!
Resetting Wakeup Pattern, OK!
Resetting Resolve Neighbor, OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Restart the computer to complete this action.

 
============================================================ 
End of execution. 
============================================================ 
 
 
============================================================ 
Choice number chosen: 10 
============================================================ 
 
 
============================================================ 
Command: "netsh" "int ip reset" 
Description: "Resets TCP/IP stack (IPv4)." 
============================================================ 
 
 
 
============================================================ 
Running command: "netsh" "int ip reset" 
============================================================ 
 
Resetting Compartment Forwarding, OK!
Resetting Compartment, OK!
Resetting Control Protocol, OK!
Resetting Echo Sequence Request, OK!
Resetting Global, OK!
Resetting Interface, failed.
The requested operation requires elevation (Run as administrator).
Resetting Anycast Address, OK!
Resetting Multicast Address, OK!
Resetting Unicast Address, OK!
Resetting Neighbor, OK!
Resetting Path, OK!
Resetting Potential, OK!
Resetting Prefix Policy, OK!
Resetting Proxy Neighbor, OK!
Resetting Route, OK!
Resetting Site Prefix, OK!
Resetting Subinterface, OK!
Resetting Wakeup Pattern, OK!
Resetting Resolve Neighbor, OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Restart the computer to complete this action.

 
============================================================ 
End of execution. 
============================================================ 
 
 
============================================================ 
Command: "netsh" "int ipv6 reset" 
Description: "Resets TCP/IP stack (IPv6)." 
============================================================ 
 
 
 
============================================================ 
Running command: "netsh" "int ipv6 reset" 
============================================================ 
 
Resetting Compartment Forwarding, OK!
Resetting Compartment, OK!
Resetting Control Protocol, OK!
Resetting Echo Sequence Request, OK!
Resetting Global, OK!
Resetting Interface, OK!
Resetting Anycast Address, OK!
Resetting Multicast Address, OK!
Resetting Unicast Address, OK!
Resetting Neighbor, OK!
Resetting Path, OK!
Resetting Potential, OK!
Resetting Prefix Policy, OK!
Resetting Proxy Neighbor, OK!
Resetting Route, OK!
Resetting Site Prefix, OK!
Resetting Subinterface, OK!
Resetting Wakeup Pattern, OK!
Resetting Resolve Neighbor, OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Restart the computer to complete this action.

 
============================================================ 
End of execution. 
============================================================ 
 
 
============================================================ 
Command: "netsh" "winsock reset" 
Description: "Resets Winsock." 
============================================================ 
 
 
 
============================================================ 
Running command: "netsh" "winsock reset" 
============================================================ 
 
The requested operation requires elevation (Run as administrator).

 
============================================================ 
End of execution. 
============================================================ 
 
 
============================================================ 
Choice number chosen: 11 
============================================================ 
 
 
============================================================ 
Choice number chosen: 11 
============================================================ 
 
 
============================================================ 
Choice number chosen: 12 
============================================================ 
 
 
============================================================ 
Command: "arp -d *"  
Description: "Clears the ARP cache. (this command does not produce any output don't worry if its blank it silently does it)" 
============================================================ 
 
 
 
============================================================ 
Running command in PowerShell: "arp -d *"  
============================================================ 
 
 
============================================================ 
End of execution. 
============================================================ 
 
 
============================================================ 
Choice number chosen: 13 
============================================================ 
 
 
============================================================ 
Command: "netsh" "winsock reset" 
Description: "Resets Winsock." 
============================================================ 
 
 
 
============================================================ 
Running command: "netsh" "winsock reset" 
============================================================ 
 
The requested operation requires elevation (Run as administrator).

 
============================================================ 
End of execution. 
============================================================ 
 
 
============================================================ 
Choice number chosen: 14 
============================================================ 
 
 
============================================================ 
Command: "netsh" "interface show interface" 
Description: "Displays the status of network adapters." 
============================================================ 
 
 
 
============================================================ 
Running command: "netsh" "interface show interface" 
============================================================ 
 

Admin State    State          Type             Interface Name
-------------------------------------------------------------------------
Disabled       Disconnected   Dedicated        VMware Network Adapter VMnet1
Disabled       Disconnected   Dedicated        VMware Network Adapter VMnet8
Enabled        Connected      Dedicated        Ethernet
Disabled       Disconnected   Dedicated        Wi-Fi
Enabled        Connected      Dedicated        vEthernet (Ethernet)
Enabled        Connected      Dedicated        vEthernet (Default Switch)

 
============================================================ 
End of execution. 
============================================================ 
 
 
============================================================ 
Command: "netsh" "interface set interface name="Ethernet" admin=disable" 
Description: "Disables the Ethernet adapter. (this command does not produce any output don't worry if its blank it silently does it)" 
============================================================ 
 
 
 
============================================================ 
Running command: "netsh" "interface set interface name="Ethernet" admin=disable" 
============================================================ 
 
The requested operation requires elevation (Run as administrator).

 
============================================================ 
End of execution. 
============================================================ 
 
 
============================================================ 
Command: "netsh" "interface show interface" 
Description: "Displays the status of network adapters." 
============================================================ 
 
 
Skipping command: "netsh" "interface show interface" 
Command skipped. 
 
============================================================ 
Command: "netsh" "interface set interface name="Ethernet" admin=enable" 
Description: "Enables the Ethernet adapter. (this command does not produce any output don't worry if its blank it silently does it)" 
============================================================ 
 
 
Skipping command: "netsh" "interface set interface name="Ethernet" admin=enable" 
Command skipped. 
 
============================================================ 
Command: "netsh" "interface show interface" 
Description: "Displays the status of network adapters." 
============================================================ 
 
 
Skipping command: "netsh" "interface show interface" 
Command skipped. 
 
============================================================ 
Choice number chosen: 15 
============================================================ 
 
 
============================================================ 
Command: "ipconfig" "/flushdns" 
Description: "Flushes and resets the contents of the DNS client resolver cache." 
============================================================ 
 
 
 
============================================================ 
Running command: "ipconfig" "/flushdns" 
============================================================ 
 

Windows IP Configuration

Successfully flushed the DNS Resolver Cache.
 
============================================================ 
End of execution. 
============================================================ 
 
 
============================================================ 
Command: "netsh" "winsock reset" 
Description: "Resets Winsock." 
============================================================ 
 
 
 
============================================================ 
Running command: "netsh" "winsock reset" 
============================================================ 
 
The requested operation requires elevation (Run as administrator).

 
============================================================ 
End of execution. 
============================================================ 
 
 
============================================================ 
Command: "netsh" "int ip reset" 
Description: "Resets TCP/IP stack (IPv4)." 
============================================================ 
 
 
 
============================================================ 
Running command: "netsh" "int ip reset" 
============================================================ 
 
Resetting Compartment Forwarding, OK!
Resetting Compartment, OK!
Resetting Control Protocol, OK!
Resetting Echo Sequence Request, OK!
Resetting Global, OK!
Resetting Interface, failed.
The requested operation requires elevation (Run as administrator).
Resetting Anycast Address, OK!
Resetting Multicast Address, OK!
Resetting Unicast Address, OK!
Resetting Neighbor, OK!
Resetting Path, OK!
Resetting Potential, OK!
Resetting Prefix Policy, OK!
Resetting Proxy Neighbor, OK!
Resetting Route, OK!
Resetting Site Prefix, OK!
Resetting Subinterface, OK!
Resetting Wakeup Pattern, OK!
Resetting Resolve Neighbor, OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Restart the computer to complete this action.

 
============================================================ 
End of execution. 
============================================================ 
 
 
============================================================ 
Command: "arp -d *"  
Description: "Clears the ARP cache. (this command does not produce any output don't worry if its blank it silently does it)" 
============================================================ 
 
 
 
============================================================ 
Running command in PowerShell: "arp -d *"  
============================================================ 
 
 
============================================================ 
End of execution. 
============================================================ 
 
 
============================================================ 
Choice number chosen: 16 
============================================================ 
 
 
============================================================ 
Choice number chosen: 16 
============================================================ 
 
 
============================================================ 
Choice number chosen: 16 
============================================================ 
 
 
============================================================ 
Choice number chosen: 17 
============================================================ 
 
 
============================================================ 
Command: "Get-WmiObject Win32_PnPEntity | Select-Object Caption, DriverVersion"  
Description: "Displays network driver information." 
============================================================ 
 
 
 
============================================================ 
Running command in PowerShell: "Get-WmiObject Win32_PnPEntity | Select-Object Caption, DriverVersion"  
============================================================ 
 
 
============================================================ 
End of execution. 
============================================================ 
 
