Logging started at 2025-01-17_02-55-08 
============================ 
Command: "ipconfig" "/all" 
Description: "Displays the current network configuration." 
============================ 
============================ 
Running command: "ipconfig" "/all" 
============================ 

Windows IP Configuration

   Host Name . . . . . . . . . . . . : DESKTOP-NRVEPHN
   Primary Dns Suffix  . . . . . . . : 
   Node Type . . . . . . . . . . . . : Hybrid
   IP Routing Enabled. . . . . . . . : No
   WINS Proxy Enabled. . . . . . . . : No

Ethernet adapter vEthernet (Ethernet):

   Connection-specific DNS Suffix  . : 
   Description . . . . . . . . . . . : Hyper-V Virtual Ethernet Adapter
   Physical Address. . . . . . . . . : 00-15-5D-FD-B1-66
   DHCP Enabled. . . . . . . . . . . : No
   Autoconfiguration Enabled . . . . : Yes
   Link-local IPv6 Address . . . . . : fe80::a412:8cbc:57bb:5b81%17(Preferred) 
   Autoconfiguration IPv4 Address. . : 169.254.72.108(Preferred) 
   Subnet Mask . . . . . . . . . . . : 255.255.0.0
   Default Gateway . . . . . . . . . : 
   DHCPv6 IAID . . . . . . . . . . . : 285218141
   DHCPv6 Client DUID. . . . . . . . : 00-01-00-01-2B-C0-74-8D-08-8F-C3-03-BE-8A
   DNS Servers . . . . . . . . . . . : fec0:0:0:ffff::1%1
                                       fec0:0:0:ffff::2%1
                                       fec0:0:0:ffff::3%1
   NetBIOS over Tcpip. . . . . . . . : Enabled

Ethernet adapter vEthernet (Default Switch):

   Connection-specific DNS Suffix  . : 
   Description . . . . . . . . . . . : Hyper-V Virtual Ethernet Adapter #2
   Physical Address. . . . . . . . . : 00-15-5D-9E-7F-C6
   DHCP Enabled. . . . . . . . . . . : No
   Autoconfiguration Enabled . . . . : Yes
   Link-local IPv6 Address . . . . . : fe80::fe95:3ddc:244:faf0%25(Preferred) 
   Autoconfiguration IPv4 Address. . : 169.254.248.171(Preferred) 
   Subnet Mask . . . . . . . . . . . : 255.255.0.0
   Default Gateway . . . . . . . . . : 
   DHCPv6 IAID . . . . . . . . . . . : 419435869
   DHCPv6 Client DUID. . . . . . . . : 00-01-00-01-2B-C0-74-8D-08-8F-C3-03-BE-8A
   DNS Servers . . . . . . . . . . . : fec0:0:0:ffff::1%1
                                       fec0:0:0:ffff::2%1
                                       fec0:0:0:ffff::3%1
   NetBIOS over Tcpip. . . . . . . . : Enabled

Ethernet adapter Ethernet:

   Connection-specific DNS Suffix  . : 
   Description . . . . . . . . . . . : Killer E2600 Gigabit Ethernet Controller
   Physical Address. . . . . . . . . : 08-8F-C3-03-BE-8A
   DHCP Enabled. . . . . . . . . . . : Yes
   Autoconfiguration Enabled . . . . : Yes
   IPv6 Address. . . . . . . . . . . : 2407:d000:b:aef1:eee9:529:26e3:4f14(Preferred) 
   Temporary IPv6 Address. . . . . . : 2407:d000:b:aef1:559a:7ed5:1ce9:1f6d(Deprecated) 
   Temporary IPv6 Address. . . . . . : 2407:d000:b:aef1:e456:56c9:2f2f:3621(Preferred) 
   Link-local IPv6 Address . . . . . : fe80::3e26:40a:1668:a2b1%11(Preferred) 
   IPv4 Address. . . . . . . . . . . : 192.168.18.232(Preferred) 
   Subnet Mask . . . . . . . . . . . : 255.255.255.0
   Lease Obtained. . . . . . . . . . : Friday, January 17, 2025 2:48:48 AM
   Lease Expires . . . . . . . . . . : Friday, January 17, 2025 3:48:52 AM
   Default Gateway . . . . . . . . . : fe80::1%11
                                       192.168.18.1
   DHCP Server . . . . . . . . . . . : 192.168.18.1
   DHCPv6 IAID . . . . . . . . . . . : 252219331
   DHCPv6 Client DUID. . . . . . . . : 00-01-00-01-2B-C0-74-8D-08-8F-C3-03-BE-8A
   DNS Servers . . . . . . . . . . . : ::ffff:127.0.2.2
                                       ::ffff:127.0.2.3
                                       127.0.2.2
                                       127.0.2.3
   NetBIOS over Tcpip. . . . . . . . : Enabled
=============== 
End of execution. 
=============== 
============================ 
Command: "wmic" "path win32_pnpentity get caption, driverversion" 
Description: "Checks for network driver updates." 
============================ 
============================ 
Running command: "wmic" "path win32_pnpentity get caption, driverversion" 
============================ 
wmic : Invalid GET Expression.
At line:1 char:5
+ & { wmic path win32_pnpentity get caption, driverversion 2>&1 | Tee-O ...
+     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    + CategoryInfo          : NotSpecified: (Invalid GET Expression.:String) [], RemoteException
    + FullyQualifiedErrorId : NativeCommandError
 

=============== 
End of execution. 
=============== 
Command skipped. 
============================ 
Command: "wmic" "path win32_pnpentity get caption, driverversion" 
Description: "Checks for network driver updates." 
============================ 
============================ 
Running command: "wmic" "path win32_pnpentity get caption, driverversion" 
============================ 
wmic : Invalid GET Expression.
At line:1 char:11
+ & { try { wmic path win32_pnpentity get caption, driverversion 2>&1 | ...
+           ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    + CategoryInfo          : NotSpecified: (Invalid GET Expression.:String) [], RemoteException
    + FullyQualifiedErrorId : NativeCommandError
 

=============== 
End of execution. 
=============== 
============================ 
Command: "ipconfig" "/flushdns" 
Description: "Flushes and resets the contents of the DNS client resolver cache." 
============================ 
============================ 
Running command: "ipconfig" "/flushdns" 
============================ 

Windows IP Configuration

Successfully flushed the DNS Resolver Cache.
=============== 
End of execution. 
=============== 
============================ 
Command: "arp" "-d *" 
Description: "Clears the ARP cache." 
============================ 
============================ 
Running command: "arp" "-d *" 
============================ 
arp : The ARP entry deletion failed: The requested operation requires elevation.
At line:1 char:11
+ & { try { arp -d * 2>&1 | Tee-Object -FilePath temp_log.txt -Append;  ...
+           ~~~~~~~~~~~~~
    + CategoryInfo          : NotSpecified: (The ARP entry d...ires elevation.:String) [], RemoteException
    + FullyQualifiedErrorId : NativeCommandError
 

=============== 
End of execution. 
=============== 
============================ 
Command: "ipconfig" "/displaydns" 
Description: "Displays the contents of the DNS client resolver cache." 
============================ 
============================ 
Running command: "ipconfig" "/displaydns" 
============================ 

Windows IP Configuration

    91.111.69.172.in-addr.arpa
    ----------------------------------------
    Name does not exist.


    94.111.69.172.in-addr.arpa
    ----------------------------------------
    Name does not exist.


    1.80.28.172.in-addr.arpa
    ----------------------------------------
    Record Name . . . . . : 1.80.28.172.in-addr.arpa.
    Record Type . . . . . : 12
    Time To Live  . . . . : 467979
    Data Length . . . . . : 8
    Section . . . . . . . : Answer
    PTR Record  . . . . . : DESKTOP-NRVEPHN.mshome.net


    1.48.20.172.in-addr.arpa
    ----------------------------------------
    Record Name . . . . . : 1.48.20.172.in-addr.arpa.
    Record Type . . . . . : 12
    Time To Live  . . . . : 467979
    Data Length . . . . . : 8
    Section . . . . . . . : Answer
    PTR Record  . . . . . : DESKTOP-NRVEPHN.mshome.net


    desktop-nrvephn.mshome.net
    ----------------------------------------
    No records of type AAAA


    desktop-nrvephn.mshome.net
    ----------------------------------------
    Record Name . . . . . : DESKTOP-NRVEPHN.mshome.net
    Record Type . . . . . : 1
    Time To Live  . . . . : 467979
    Data Length . . . . . : 4
    Section . . . . . . . : Answer
    A (Host) Record . . . : 172.28.80.1


    Record Name . . . . . : DESKTOP-NRVEPHN.mshome.net
    Record Type . . . . . : 1
    Time To Live  . . . . : 467979
    Data Length . . . . . : 4
    Section . . . . . . . : Answer
    A (Host) Record . . . : 172.20.48.1


=============== 
End of execution. 
=============== 
============================ 
Command: "arp" "-a" 
Description: "Displays the ARP cache." 
============================ 
============================ 
Running command: "arp" "-a" 
============================ 

Interface: 192.168.18.232 --- 0xb
  Internet Address      Physical Address      Type
  192.168.18.1          f0-63-f9-eb-a3-f8     dynamic   
  192.168.18.9          00-f4-8d-a3-f9-0b     dynamic   
  192.168.18.62         e4-b3-18-7c-73-c9     dynamic   
  192.168.18.86         4a-e5-41-c0-c9-9d     dynamic   
  192.168.18.255        ff-ff-ff-ff-ff-ff     static    
  224.0.0.2             01-00-5e-00-00-02     static    
  224.0.0.22            01-00-5e-00-00-16     static    
  224.0.0.251           01-00-5e-00-00-fb     static    
  224.0.0.252           01-00-5e-00-00-fc     static    
  224.0.2.60            01-00-5e-00-02-3c     static    
  239.255.102.18        01-00-5e-7f-66-12     static    
  239.255.255.250       01-00-5e-7f-ff-fa     static    
  255.255.255.255       ff-ff-ff-ff-ff-ff     static    

Interface: 169.254.72.108 --- 0x11
  Internet Address      Physical Address      Type
  169.254.255.255       ff-ff-ff-ff-ff-ff     static    
  224.0.0.2             01-00-5e-00-00-02     static    
  224.0.0.22            01-00-5e-00-00-16     static    
  224.0.0.251           01-00-5e-00-00-fb     static    
  224.0.2.60            01-00-5e-00-02-3c     static    
  239.255.102.18        01-00-5e-7f-66-12     static    
  239.255.255.250       01-00-5e-7f-ff-fa     static    

Interface: 169.254.248.171 --- 0x19
  Internet Address      Physical Address      Type
  169.254.255.255       ff-ff-ff-ff-ff-ff     static    
  224.0.0.2             01-00-5e-00-00-02     static    
  224.0.0.22            01-00-5e-00-00-16     static    
  224.0.0.251           01-00-5e-00-00-fb     static    
  224.0.2.60            01-00-5e-00-02-3c     static    
  239.255.102.18        01-00-5e-7f-66-12     static    
  239.255.255.250       01-00-5e-7f-ff-fa     static    
=============== 
End of execution. 
=============== 
============================ 
Command: "ipconfig" "/release" 
Description: "Releases the IP address." 
============================ 
============================ 
Running command: "ipconfig" "/release" 
============================ 

Windows IP Configuration


Ethernet adapter vEthernet (Ethernet):

   Connection-specific DNS Suffix  . : 
   Link-local IPv6 Address . . . . . : fe80::a412:8cbc:57bb:5b81%17
   Autoconfiguration IPv4 Address. . : 169.254.72.108
   Subnet Mask . . . . . . . . . . . : 255.255.0.0
   Default Gateway . . . . . . . . . : 

Ethernet adapter vEthernet (Default Switch):

   Connection-specific DNS Suffix  . : 
   Link-local IPv6 Address . . . . . : fe80::fe95:3ddc:244:faf0%25
   Autoconfiguration IPv4 Address. . : 169.254.248.171
   Subnet Mask . . . . . . . . . . . : 255.255.0.0
   Default Gateway . . . . . . . . . : 

Ethernet adapter Ethernet:

   Connection-specific DNS Suffix  . : 
   IPv6 Address. . . . . . . . . . . : 2407:d000:b:aef1:eee9:529:26e3:4f14
   Temporary IPv6 Address. . . . . . : 2407:d000:b:aef1:559a:7ed5:1ce9:1f6d
   Temporary IPv6 Address. . . . . . : 2407:d000:b:aef1:e456:56c9:2f2f:3621
   Link-local IPv6 Address . . . . . : fe80::3e26:40a:1668:a2b1%11
   Default Gateway . . . . . . . . . : fe80::1%11
=============== 
End of execution. 
=============== 
============================ 
Command: "netsh" "int ipv6 reset" 
Description: "Resets TCP/IP stack (IPv6)." 
============================ 
============================ 
Running command: "netsh" "int ipv6 reset" 
============================ 
Resetting Compartment Forwarding, OK!
Resetting Compartment, OK!
Resetting Control Protocol, OK!
Resetting Echo Sequence Request, OK!
Resetting Global, OK!
Resetting Interface, OK!
Resetting Anycast Address, OK!
Resetting Multicast Address, OK!
Resetting Unicast Address, OK!
Resetting Neighbor, OK!
Resetting Path, OK!
Resetting Potential, OK!
Resetting Prefix Policy, OK!
Resetting Proxy Neighbor, OK!
Resetting Route, OK!
Resetting Site Prefix, OK!
Resetting Subinterface, OK!
Resetting Wakeup Pattern, OK!
Resetting Resolve Neighbor, OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Restart the computer to complete this action.

=============== 
End of execution. 
=============== 
============================ 
Command: "netsh" "winsock reset" 
Description: "Resets Winsock." 
============================ 
============================ 
Running command: "netsh" "winsock reset" 
============================ 
The requested operation requires elevation (Run as administrator).

=============== 
End of execution. 
=============== 
============================ 
Command: "netsh" "interface show interface" 
Description: "Displays the status of network adapters." 
============================ 
============================ 
Running command: "netsh" "interface show interface" 
============================ 

Admin State    State          Type             Interface Name
-------------------------------------------------------------------------
Disabled       Disconnected   Dedicated        VMware Network Adapter VMnet1
Disabled       Disconnected   Dedicated        VMware Network Adapter VMnet8
Enabled        Connected      Dedicated        Ethernet
Disabled       Disconnected   Dedicated        Wi-Fi
Enabled        Connected      Dedicated        vEthernet (Ethernet)
Enabled        Connected      Dedicated        vEthernet (Default Switch)

=============== 
End of execution. 
=============== 
============================ 
Command: "netsh" "winsock reset" 
Description: "Resets Winsock." 
============================ 
============================ 
Running command: "netsh" "winsock reset" 
============================ 
The requested operation requires elevation (Run as administrator).

=============== 
End of execution. 
=============== 
============================ 
Command: "netsh" "int ip reset" 
Description: "Resets TCP/IP stack (IPv4)." 
============================ 
============================ 
Running command: "netsh" "int ip reset" 
============================ 
Resetting Compartment Forwarding, OK!
Resetting Compartment, OK!
Resetting Control Protocol, OK!
Resetting Echo Sequence Request, OK!
Resetting Global, OK!
Resetting Interface, failed.
The requested operation requires elevation (Run as administrator).
Resetting Anycast Address, OK!
Resetting Multicast Address, OK!
Resetting Unicast Address, OK!
Resetting Neighbor, OK!
Resetting Path, OK!
Resetting Potential, OK!
Resetting Prefix Policy, OK!
Resetting Proxy Neighbor, OK!
Resetting Route, OK!
Resetting Site Prefix, OK!
Resetting Subinterface, OK!
Resetting Wakeup Pattern, OK!
Resetting Resolve Neighbor, OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Restart the computer to complete this action.

=============== 
End of execution. 
=============== 
============================ 
Command: "netsh" "int ipv6 reset" 
Description: "Resets TCP/IP stack (IPv6)." 
============================ 
============================ 
Running command: "netsh" "int ipv6 reset" 
============================ 
Resetting Compartment Forwarding, OK!
Resetting Compartment, OK!
Resetting Control Protocol, OK!
Resetting Echo Sequence Request, OK!
Resetting Global, OK!
Resetting Interface, OK!
Resetting Anycast Address, OK!
Resetting Multicast Address, OK!
Resetting Unicast Address, OK!
Resetting Neighbor, OK!
Resetting Path, OK!
Resetting Potential, OK!
Resetting Prefix Policy, OK!
Resetting Proxy Neighbor, OK!
Resetting Route, OK!
Resetting Site Prefix, OK!
Resetting Subinterface, OK!
Resetting Wakeup Pattern, OK!
Resetting Resolve Neighbor, OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Restart the computer to complete this action.

=============== 
End of execution. 
=============== 
============================ 
Command: "netsh" "int ipv6 reset" 
Description: "Resets TCP/IP stack (IPv6)." 
============================ 
============================ 
Running command: "netsh" "int ipv6 reset" 
============================ 
Resetting Compartment Forwarding, OK!
Resetting Compartment, OK!
Resetting Control Protocol, OK!
Resetting Echo Sequence Request, OK!
Resetting Global, OK!
Resetting Interface, OK!
Resetting Anycast Address, OK!
Resetting Multicast Address, OK!
Resetting Unicast Address, OK!
Resetting Neighbor, OK!
Resetting Path, OK!
Resetting Potential, OK!
Resetting Prefix Policy, OK!
Resetting Proxy Neighbor, OK!
Resetting Route, OK!
Resetting Site Prefix, OK!
Resetting Subinterface, OK!
Resetting Wakeup Pattern, OK!
Resetting Resolve Neighbor, OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Restart the computer to complete this action.

=============== 
End of execution. 
=============== 
============================ 
Command: "netsh" "winsock reset" 
Description: "Resets Winsock." 
============================ 
============================ 
Running command: "netsh" "winsock reset" 
============================ 
The requested operation requires elevation (Run as administrator).

=============== 
End of execution. 
=============== 
============================ 
Command: "netsh" "interface set interface name="Ethernet" admin=disable" 
Description: "Disables the Ethernet adapter." 
============================ 
============================ 
Running command: "netsh" "interface set interface name="Ethernet" admin=disable" 
============================ 
The requested operation requires elevation (Run as administrator).

=============== 
End of execution. 
=============== 
============================ 
Command: "netsh" "interface set interface name="Ethernet" admin=enable" 
Description: "Enables the Ethernet adapter." 
============================ 
============================ 
Running command: "netsh" "interface set interface name="Ethernet" admin=enable" 
============================ 
The requested operation requires elevation (Run as administrator).

=============== 
End of execution. 
=============== 
============================ 
Command: "netsh" "interface set interface name="Ethernet" admin=disable" 
Description: "Disables the Ethernet adapter." 
============================ 
============================ 
Running command: "netsh" "interface set interface name="Ethernet" admin=disable" 
============================ 
The requested operation requires elevation (Run as administrator).

=============== 
End of execution. 
=============== 
============================ 
Command: "netsh" "interface set interface name="Ethernet" admin=enable" 
Description: "Enables the Ethernet adapter." 
============================ 
============================ 
Running command: "netsh" "interface set interface name="Ethernet" admin=enable" 
============================ 
The requested operation requires elevation (Run as administrator).

=============== 
End of execution. 
=============== 
============================ 
Choice number chosen: 1 
============================ 
============================ 
Command: "ipconfig" "/flushdns" 
Description: "Flushes and resets the contents of the DNS client resolver cache." 
============================ 
============================ 
Running command: "ipconfig" "/flushdns" 
============================ 

Windows IP Configuration

Successfully flushed the DNS Resolver Cache.
=============== 
End of execution. 
=============== 
 
============================ 
Choice number chosen: 1 
============================ 
 
============================ 
Command: "ipconfig" "/flushdns" 
Description: "Flushes and resets the contents of the DNS client resolver cache." 
============================ 
 
 
============================ 
Running command: "ipconfig" "/flushdns" 
============================ 
 

Windows IP Configuration

Successfully flushed the DNS Resolver Cache.
 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 1 
============================ 
 
============================ 
Command: "ipconfig" "/flushdns" 
Description: "Flushes and resets the contents of the DNS client resolver cache." 
============================ 
 
 
============================ 
Running command: "ipconfig" "/flushdns" 
============================ 
 

Windows IP Configuration

Successfully flushed the DNS Resolver Cache.
 
=============== 
End of execution. 
=============== 
 

USAGE:
    ipconfig [/allcompartments] [/? | /all | 
                                 /renew [adapter] | /release [adapter] |
                                 /renew6 [adapter] | /release6 [adapter] |
                                 /flushdns | /displaydns | /registerdns |
                                 /showclassid adapter |
                                 /setclassid adapter [classid] |
                                 /showclassid6 adapter |
                                 /setclassid6 adapter [classid] ]

where
    adapter             Connection name 
                       (wildcard characters * and ? allowed, see examples)

    Options:
       /?               Display this help message
       /all             Display full configuration information.
       /release         Release the IPv4 address for the specified adapter.
       /release6        Release the IPv6 address for the specified adapter.
       /renew           Renew the IPv4 address for the specified adapter.
       /renew6          Renew the IPv6 address for the specified adapter.
       /flushdns        Purges the DNS Resolver cache.
       /registerdns     Refreshes all DHCP leases and re-registers DNS names
       /displaydns      Display the contents of the DNS Resolver Cache.
       /showclassid     Displays all the dhcp class IDs allowed for adapter.
       /setclassid      Modifies the dhcp class id.  
       /showclassid6    Displays all the IPv6 DHCP class IDs allowed for adapter.
       /setclassid6     Modifies the IPv6 DHCP class id.


The default is to display only the IP address, subnet mask and
default gateway for each adapter bound to TCP/IP.

For Release and Renew, if no adapter name is specified, then the IP address
leases for all adapters bound to TCP/IP will be released or renewed.

For Setclassid and Setclassid6, if no ClassId is specified, then the ClassId is removed.

Examples:
    > ipconfig                       ... Show information
    > ipconfig /all                  ... Show detailed information
    > ipconfig /renew                ... renew all adapters
    > ipconfig /renew EL*            ... renew any connection that has its 
                                         name starting with EL
    > ipconfig /release *Con*        ... release all matching connections,
                                         eg. "Wired Ethernet Connection 1" or
                                             "Wired Ethernet Connection 2"
    > ipconfig /allcompartments      ... Show information about all 
                                         compartments
    > ipconfig /allcompartments /all ... Show detailed information about all
                                         compartments
Skipping command: "ipconfig" "/flushdns" 
Command skipped. 
 
============================ 
Choice number chosen: 1 
============================ 
 
============================ 
Command: "ipconfig" "/flushdns" 
Description: "Flushes and resets the contents of the DNS client resolver cache." 
============================ 
 
 
============================ 
Running command: "ipconfig" "/flushdns" 
============================ 
 

Windows IP Configuration

Successfully flushed the DNS Resolver Cache.
 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 1 
============================ 
 
============================ 
Command: "ipconfig" "/flushdns" 
Description: "Flushes and resets the contents of the DNS client resolver cache." 
============================ 
 
 
============================ 
Running command: "ipconfig" "/flushdns" 
============================ 
 

Windows IP Configuration

Successfully flushed the DNS Resolver Cache.
 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 1 
============================ 
 
============================ 
Command: "ipconfig" "/flushdns" 
Description: "Flushes and resets the contents of the DNS client resolver cache." 
============================ 
 
 
============================ 
Running command: "ipconfig" "/flushdns" 
============================ 
 

Windows IP Configuration

Successfully flushed the DNS Resolver Cache.
 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 1 
============================ 
 
============================ 
Command: "ipconfig" "/flushdns" 
Description: "Flushes and resets the contents of the DNS client resolver cache." 
============================ 
 
 
============================ 
Running command: "ipconfig" "/flushdns" 
============================ 
 

Windows IP Configuration

Successfully flushed the DNS Resolver Cache.
 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 1 
============================ 
 
============================ 
Command: "ipconfig" "/flushdns" 
Description: "Flushes and resets the contents of the DNS client resolver cache." 
============================ 
 
 
============================ 
Running command: "ipconfig" "/flushdns" 
============================ 
 

Windows IP Configuration

Successfully flushed the DNS Resolver Cache.
 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 1 
============================ 
 
============================ 
Command: "ipconfig" "/flushdns" 
Description: "Flushes and resets the contents of the DNS client resolver cache." 
============================ 
 
============================ 

USAGE:
    ipconfig [/allcompartments] [/? | /all | 
                                 /renew [adapter] | /release [adapter] |
                                 /renew6 [adapter] | /release6 [adapter] |
                                 /flushdns | /displaydns | /registerdns |
                                 /showclassid adapter |
                                 /setclassid adapter [classid] |
                                 /showclassid6 adapter |
                                 /setclassid6 adapter [classid] ]

where
    adapter             Connection name 
                       (wildcard characters * and ? allowed, see examples)

    Options:
       /?               Display this help message
       /all             Display full configuration information.
       /release         Release the IPv4 address for the specified adapter.
       /release6        Release the IPv6 address for the specified adapter.
       /renew           Renew the IPv4 address for the specified adapter.
       /renew6          Renew the IPv6 address for the specified adapter.
       /flushdns        Purges the DNS Resolver cache.
       /registerdns     Refreshes all DHCP leases and re-registers DNS names
       /displaydns      Display the contents of the DNS Resolver Cache.
       /showclassid     Displays all the dhcp class IDs allowed for adapter.
       /setclassid      Modifies the dhcp class id.  
       /showclassid6    Displays all the IPv6 DHCP class IDs allowed for adapter.
       /setclassid6     Modifies the IPv6 DHCP class id.


The default is to display only the IP address, subnet mask and
default gateway for each adapter bound to TCP/IP.

For Release and Renew, if no adapter name is specified, then the IP address
leases for all adapters bound to TCP/IP will be released or renewed.

For Setclassid and Setclassid6, if no ClassId is specified, then the ClassId is removed.

Examples:
    > ipconfig                       ... Show information
    > ipconfig /all                  ... Show detailed information
    > ipconfig /renew                ... renew all adapters
    > ipconfig /renew EL*            ... renew any connection that has its 
                                         name starting with EL
    > ipconfig /release *Con*        ... release all matching connections,
                                         eg. "Wired Ethernet Connection 1" or
                                             "Wired Ethernet Connection 2"
    > ipconfig /allcompartments      ... Show information about all 
                                         compartments
    > ipconfig /allcompartments /all ... Show detailed information about all
                                         compartments
 
============================ 
Choice number chosen: 1 
============================ 
 
============================ 
Command: "ipconfig" "/flushdns" 
Description: "Flushes and resets the contents of the DNS client resolver cache." 
============================ 
 
 
============================ 

USAGE:
    ipconfig [/allcompartments] [/? | /all | 
                                 /renew [adapter] | /release [adapter] |
                                 /renew6 [adapter] | /release6 [adapter] |
                                 /flushdns | /displaydns | /registerdns |
                                 /showclassid adapter |
                                 /setclassid adapter [classid] |
                                 /showclassid6 adapter |
                                 /setclassid6 adapter [classid] ]

where
    adapter             Connection name 
                       (wildcard characters * and ? allowed, see examples)

    Options:
       /?               Display this help message
       /all             Display full configuration information.
       /release         Release the IPv4 address for the specified adapter.
       /release6        Release the IPv6 address for the specified adapter.
       /renew           Renew the IPv4 address for the specified adapter.
       /renew6          Renew the IPv6 address for the specified adapter.
       /flushdns        Purges the DNS Resolver cache.
       /registerdns     Refreshes all DHCP leases and re-registers DNS names
       /displaydns      Display the contents of the DNS Resolver Cache.
       /showclassid     Displays all the dhcp class IDs allowed for adapter.
       /setclassid      Modifies the dhcp class id.  
       /showclassid6    Displays all the IPv6 DHCP class IDs allowed for adapter.
       /setclassid6     Modifies the IPv6 DHCP class id.


The default is to display only the IP address, subnet mask and
default gateway for each adapter bound to TCP/IP.

For Release and Renew, if no adapter name is specified, then the IP address
leases for all adapters bound to TCP/IP will be released or renewed.

For Setclassid and Setclassid6, if no ClassId is specified, then the ClassId is removed.

Examples:
    > ipconfig                       ... Show information
    > ipconfig /all                  ... Show detailed information
    > ipconfig /renew                ... renew all adapters
    > ipconfig /renew EL*            ... renew any connection that has its 
                                         name starting with EL
    > ipconfig /release *Con*        ... release all matching connections,
                                         eg. "Wired Ethernet Connection 1" or
                                             "Wired Ethernet Connection 2"
    > ipconfig /allcompartments      ... Show information about all 
                                         compartments
    > ipconfig /allcompartments /all ... Show detailed information about all
                                         compartments
 
============================ 
Choice number chosen: 1 
============================ 
 
============================ 
Command: "ipconfig" "/flushdns" 
Description: "Flushes and resets the contents of the DNS client resolver cache." 
============================ 
 
 
============================ 

USAGE:
    ipconfig [/allcompartments] [/? | /all | 
                                 /renew [adapter] | /release [adapter] |
                                 /renew6 [adapter] | /release6 [adapter] |
                                 /flushdns | /displaydns | /registerdns |
                                 /showclassid adapter |
                                 /setclassid adapter [classid] |
                                 /showclassid6 adapter |
                                 /setclassid6 adapter [classid] ]

where
    adapter             Connection name 
                       (wildcard characters * and ? allowed, see examples)

    Options:
       /?               Display this help message
       /all             Display full configuration information.
       /release         Release the IPv4 address for the specified adapter.
       /release6        Release the IPv6 address for the specified adapter.
       /renew           Renew the IPv4 address for the specified adapter.
       /renew6          Renew the IPv6 address for the specified adapter.
       /flushdns        Purges the DNS Resolver cache.
       /registerdns     Refreshes all DHCP leases and re-registers DNS names
       /displaydns      Display the contents of the DNS Resolver Cache.
       /showclassid     Displays all the dhcp class IDs allowed for adapter.
       /setclassid      Modifies the dhcp class id.  
       /showclassid6    Displays all the IPv6 DHCP class IDs allowed for adapter.
       /setclassid6     Modifies the IPv6 DHCP class id.


The default is to display only the IP address, subnet mask and
default gateway for each adapter bound to TCP/IP.

For Release and Renew, if no adapter name is specified, then the IP address
leases for all adapters bound to TCP/IP will be released or renewed.

For Setclassid and Setclassid6, if no ClassId is specified, then the ClassId is removed.

Examples:
    > ipconfig                       ... Show information
    > ipconfig /all                  ... Show detailed information
    > ipconfig /renew                ... renew all adapters
    > ipconfig /renew EL*            ... renew any connection that has its 
                                         name starting with EL
    > ipconfig /release *Con*        ... release all matching connections,
                                         eg. "Wired Ethernet Connection 1" or
                                             "Wired Ethernet Connection 2"
    > ipconfig /allcompartments      ... Show information about all 
                                         compartments
    > ipconfig /allcompartments /all ... Show detailed information about all
                                         compartments
 
============================ 
Choice number chosen: 1 
============================ 
 
============================ 
Command: "ipconfig" "/flushdns" 
Description: "Flushes and resets the contents of the DNS client resolver cache." 
============================ 
 
 
 
============================ 
Running command: "ipconfig" "/flushdns" 
============================ 
 

Windows IP Configuration

Successfully flushed the DNS Resolver Cache.
 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 2 
============================ 
 
============================ 
Command: "arp" "-d *" 
Description: "Clears the ARP cache." 
============================ 
 
 
 
============================ 
Running command: "arp" "-d *" 
============================ 
 
arp : The ARP entry deletion failed: The requested operation requires elevation.
At line:1 char:11
+ & { try { arp -d * 2>&1 | Tee-Object -FilePath temp_log.txt -Append;  ...
+           ~~~~~~~~~~~~~
    + CategoryInfo          : NotSpecified: (The ARP entry d...ires elevation.:String) [], RemoteException
    + FullyQualifiedErrorId : NativeCommandError
 

 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 3 
============================ 
 
============================ 
Command: "ipconfig" "/displaydns" 
Description: "Displays the contents of the DNS client resolver cache." 
============================ 
 
 
 
============================ 
Running command: "ipconfig" "/displaydns" 
============================ 
 

Windows IP Configuration

    108.111.69.172.in-addr.arpa
    ----------------------------------------
    Name does not exist.


    1.80.28.172.in-addr.arpa
    ----------------------------------------
    Record Name . . . . . : 1.80.28.172.in-addr.arpa.
    Record Type . . . . . : 12
    Time To Live  . . . . : 466893
    Data Length . . . . . : 8
    Section . . . . . . . : Answer
    PTR Record  . . . . . : DESKTOP-NRVEPHN.mshome.net


    westus-0.in.applicationinsights.azure.com
    ----------------------------------------
    No records of type AAAA


    westus-0.in.applicationinsights.azure.com
    ----------------------------------------
    Record Name . . . . . : westus-0.in.applicationinsights.azure.com
    Record Type . . . . . : 5
    Time To Live  . . . . : 2
    Data Length . . . . . : 8
    Section . . . . . . . : Answer
    CNAME Record  . . . . : westus-0.in.ai.monitor.azure.com


    Record Name . . . . . : westus-0.in.ai.monitor.azure.com
    Record Type . . . . . : 5
    Time To Live  . . . . : 2
    Data Length . . . . . : 8
    Section . . . . . . . : Answer
    CNAME Record  . . . . : westus-0.in.ai.privatelink.monitor.azure.com


    Record Name . . . . . : westus-0.in.ai.privatelink.monitor.azure.com
    Record Type . . . . . : 5
    Time To Live  . . . . : 2
    Data Length . . . . . : 8
    Section . . . . . . . : Answer
    CNAME Record  . . . . : gig-ai-prod-westus-0.trafficmanager.net


    Record Name . . . . . : gig-ai-prod-westus-0.trafficmanager.net
    Record Type . . . . . : 5
    Time To Live  . . . . : 2
    Data Length . . . . . : 8
    Section . . . . . . . : Answer
    CNAME Record  . . . . : gig-ai-prod-wus-0-app-v4-tag.westus.cloudapp.azure.com


    Record Name . . . . . : gig-ai-prod-wus-0-app-v4-tag.westus.cloudapp.azure.com
    Record Type . . . . . : 1
    Time To Live  . . . . : 2
    Data Length . . . . . : 4
    Section . . . . . . . : Answer
    A (Host) Record . . . : 20.189.172.32


    time.cloudflare.com
    ----------------------------------------
    Record Name . . . . . : time.cloudflare.com
    Record Type . . . . . : 28
    Time To Live  . . . . : 276
    Data Length . . . . . : 16
    Section . . . . . . . : Answer
    AAAA Record . . . . . : 2606:4700:f1::1


    Record Name . . . . . : time.cloudflare.com
    Record Type . . . . . : 28
    Time To Live  . . . . : 276
    Data Length . . . . . : 16
    Section . . . . . . . : Answer
    AAAA Record . . . . . : 2606:4700:f1::123


    time.cloudflare.com
    ----------------------------------------
    Record Name . . . . . : time.cloudflare.com
    Record Type . . . . . : 1
    Time To Live  . . . . : 136
    Data Length . . . . . : 4
    Section . . . . . . . : Answer
    A (Host) Record . . . : 162.159.200.1


    Record Name . . . . . : time.cloudflare.com
    Record Type . . . . . : 1
    Time To Live  . . . . : 136
    Data Length . . . . . : 4
    Section . . . . . . . : Answer
    A (Host) Record . . . : 162.159.200.123


    ocsp.digicert.com
    ----------------------------------------
    No records of type AAAA


    ocsp.digicert.com
    ----------------------------------------
    Record Name . . . . . : ocsp.digicert.com
    Record Type . . . . . : 5
    Time To Live  . . . . : 15
    Data Length . . . . . : 8
    Section . . . . . . . : Answer
    CNAME Record  . . . . : ocsp.edge.digicert.com


    Record Name . . . . . : ocsp.edge.digicert.com
    Record Type . . . . . : 5
    Time To Live  . . . . : 15
    Data Length . . . . . : 8
    Section . . . . . . . : Answer
    CNAME Record  . . . . : cac-ocsp.digicert.com.edgekey.net


    Record Name . . . . . : cac-ocsp.digicert.com.edgekey.net
    Record Type . . . . . : 5
    Time To Live  . . . . : 15
    Data Length . . . . . : 8
    Section . . . . . . . : Answer
    CNAME Record  . . . . : e3913.cd.akamaiedge.net


    Record Name . . . . . : e3913.cd.akamaiedge.net
    Record Type . . . . . : 1
    Time To Live  . . . . : 15
    Data Length . . . . . : 4
    Section . . . . . . . : Answer
    A (Host) Record . . . : 23.38.59.250


    104.111.69.172.in-addr.arpa
    ----------------------------------------
    Name does not exist.


    1.48.20.172.in-addr.arpa
    ----------------------------------------
    Record Name . . . . . : 1.48.20.172.in-addr.arpa.
    Record Type . . . . . : 12
    Time To Live  . . . . : 466893
    Data Length . . . . . : 8
    Section . . . . . . . : Answer
    PTR Record  . . . . . : DESKTOP-NRVEPHN.mshome.net


    desktop-nrvephn.mshome.net
    ----------------------------------------
    No records of type AAAA


    desktop-nrvephn.mshome.net
    ----------------------------------------
    Record Name . . . . . : DESKTOP-NRVEPHN.mshome.net
    Record Type . . . . . : 1
    Time To Live  . . . . : 466893
    Data Length . . . . . : 4
    Section . . . . . . . : Answer
    A (Host) Record . . . : 172.28.80.1


    Record Name . . . . . : DESKTOP-NRVEPHN.mshome.net
    Record Type . . . . . : 1
    Time To Live  . . . . : 466893
    Data Length . . . . . : 4
    Section . . . . . . . : Answer
    A (Host) Record . . . : 172.20.48.1


    events.gfe.nvidia.com
    ----------------------------------------
    No records of type AAAA


    events.gfe.nvidia.com
    ----------------------------------------
    Record Name . . . . . : events.gfe.nvidia.com
    Record Type . . . . . : 1
    Time To Live  . . . . : 118
    Data Length . . . . . : 4
    Section . . . . . . . : Answer
    A (Host) Record . . . : 72.25.64.32


    prod.otel.kaizen.nvidia.com
    ----------------------------------------
    No records of type AAAA


    prod.otel.kaizen.nvidia.com
    ----------------------------------------
    Record Name . . . . . : prod.otel.kaizen.nvidia.com
    Record Type . . . . . : 1
    Time To Live  . . . . : 4
    Data Length . . . . . : 4
    Section . . . . . . . : Answer
    A (Host) Record . . . : 63.176.90.252


    Record Name . . . . . : prod.otel.kaizen.nvidia.com
    Record Type . . . . . : 1
    Time To Live  . . . . : 4
    Data Length . . . . . : 4
    Section . . . . . . . : Answer
    A (Host) Record . . . : 63.176.236.234


    Record Name . . . . . : prod.otel.kaizen.nvidia.com
    Record Type . . . . . : 1
    Time To Live  . . . . : 4
    Data Length . . . . . : 4
    Section . . . . . . . : Answer
    A (Host) Record . . . : 3.71.226.131


 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 4 
============================ 
 
============================ 
Choice number chosen: 4 
============================ 
 
============================ 
Choice number chosen: 4 
============================ 
 
============================ 
Choice number chosen: 1 
============================ 
 
============================ 
Command: "ipconfig" "/flushdns" 
Description: "Flushes and resets the contents of the DNS client resolver cache." 
============================ 
 
 
 
============================ 
Running command: "ipconfig" "/flushdns" 
============================ 
 

Windows IP Configuration

Successfully flushed the DNS Resolver Cache.
 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 4 
============================ 
 
============================ 
Choice number chosen: 5 
============================ 
 
============================ 
Command: "ipconfig" "/release" 
Description: "Releases the IP address." 
============================ 
 
 
 
============================ 
Running command: "ipconfig" "/release" 
============================ 
 

Windows IP Configuration


Ethernet adapter vEthernet (Ethernet):

   Connection-specific DNS Suffix  . : 
   Link-local IPv6 Address . . . . . : fe80::a412:8cbc:57bb:5b81%17
   Autoconfiguration IPv4 Address. . : 169.254.72.108
   Subnet Mask . . . . . . . . . . . : 255.255.0.0
   Default Gateway . . . . . . . . . : 

Ethernet adapter vEthernet (Default Switch):

   Connection-specific DNS Suffix  . : 
   Link-local IPv6 Address . . . . . : fe80::fe95:3ddc:244:faf0%25
   Autoconfiguration IPv4 Address. . : 169.254.248.171
   Subnet Mask . . . . . . . . . . . : 255.255.0.0
   Default Gateway . . . . . . . . . : 

Ethernet adapter Ethernet:

   Connection-specific DNS Suffix  . : 
   IPv6 Address. . . . . . . . . . . : 2407:d000:b:aef1:eee9:529:26e3:4f14
   Temporary IPv6 Address. . . . . . : 2407:d000:b:aef1:559a:7ed5:1ce9:1f6d
   Temporary IPv6 Address. . . . . . : 2407:d000:b:aef1:e456:56c9:2f2f:3621
   Link-local IPv6 Address . . . . . : fe80::3e26:40a:1668:a2b1%11
   Default Gateway . . . . . . . . . : fe80::1%11
 
=============== 
End of execution. 
=============== 
 
 
============================ 
Command: "netsh" "int ipv6 reset" 
Description: "Resets TCP/IP stack (IPv6)." 
============================ 
 
 
 
============================ 
Running command: "netsh" "int ipv6 reset" 
============================ 
 
Resetting Compartment Forwarding, OK!
Resetting Compartment, OK!
Resetting Control Protocol, OK!
Resetting Echo Sequence Request, OK!
Resetting Global, OK!
Resetting Interface, OK!
Resetting Anycast Address, OK!
Resetting Multicast Address, OK!
Resetting Unicast Address, OK!
Resetting Neighbor, OK!
Resetting Path, OK!
Resetting Potential, OK!
Resetting Prefix Policy, OK!
Resetting Proxy Neighbor, OK!
Resetting Route, OK!
Resetting Site Prefix, OK!
Resetting Subinterface, OK!
Resetting Wakeup Pattern, OK!
Resetting Resolve Neighbor, OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Restart the computer to complete this action.

 
=============== 
End of execution. 
=============== 
 
 
============================ 
Command: "netsh" "winsock reset" 
Description: "Resets Winsock." 
============================ 
 
 
 
============================ 
Running command: "netsh" "winsock reset" 
============================ 
 
The requested operation requires elevation (Run as administrator).

 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 5 
============================ 
 
============================ 
Command: "ipconfig" "/release" 
Description: "Releases the IP address." 
============================ 
 
 
 
============================ 
Running command: "ipconfig" "/release" 
============================ 
 

Windows IP Configuration


Ethernet adapter vEthernet (Ethernet):

   Connection-specific DNS Suffix  . : 
   Link-local IPv6 Address . . . . . : fe80::a412:8cbc:57bb:5b81%17
   Autoconfiguration IPv4 Address. . : 169.254.72.108
   Subnet Mask . . . . . . . . . . . : 255.255.0.0
   Default Gateway . . . . . . . . . : 

Ethernet adapter vEthernet (Default Switch):

   Connection-specific DNS Suffix  . : 
   Link-local IPv6 Address . . . . . : fe80::fe95:3ddc:244:faf0%25
   Autoconfiguration IPv4 Address. . : 169.254.248.171
   Subnet Mask . . . . . . . . . . . : 255.255.0.0
   Default Gateway . . . . . . . . . : 

Ethernet adapter Ethernet:

   Connection-specific DNS Suffix  . : 
   IPv6 Address. . . . . . . . . . . : 2407:d000:b:aef1:eee9:529:26e3:4f14
   Temporary IPv6 Address. . . . . . : 2407:d000:b:aef1:559a:7ed5:1ce9:1f6d
   Temporary IPv6 Address. . . . . . : 2407:d000:b:aef1:e456:56c9:2f2f:3621
   Link-local IPv6 Address . . . . . : fe80::3e26:40a:1668:a2b1%11
   Default Gateway . . . . . . . . . : fe80::1%11
 
=============== 
End of execution. 
=============== 
 
 
============================ 
Command: "netsh" "int ipv6 reset" 
Description: "Resets TCP/IP stack (IPv6)." 
============================ 
 
 
 
============================ 
Running command: "netsh" "int ipv6 reset" 
============================ 
 
Resetting Compartment Forwarding, OK!
Resetting Compartment, OK!
Resetting Control Protocol, OK!
Resetting Echo Sequence Request, OK!
Resetting Global, OK!
Resetting Interface, OK!
Resetting Anycast Address, OK!
Resetting Multicast Address, OK!
Resetting Unicast Address, OK!
Resetting Neighbor, OK!
Resetting Path, OK!
Resetting Potential, OK!
Resetting Prefix Policy, OK!
Resetting Proxy Neighbor, OK!
Resetting Route, OK!
Resetting Site Prefix, OK!
Resetting Subinterface, OK!
Resetting Wakeup Pattern, OK!
Resetting Resolve Neighbor, OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Restart the computer to complete this action.

 
=============== 
End of execution. 
=============== 
 
 
============================ 
Command: "netsh" "winsock reset" 
Description: "Resets Winsock." 
============================ 
 
 
 
============================ 
Running command: "netsh" "winsock reset" 
============================ 
 
The requested operation requires elevation (Run as administrator).

 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 6 
============================ 
 
============================ 
Command: "netsh" "interface show interface" 
Description: "Displays the status of network adapters." 
============================ 
 
 
 
============================ 
Running command: "netsh" "interface show interface" 
============================ 
 

Admin State    State          Type             Interface Name
-------------------------------------------------------------------------
Disabled       Disconnected   Dedicated        VMware Network Adapter VMnet1
Disabled       Disconnected   Dedicated        VMware Network Adapter VMnet8
Enabled        Connected      Dedicated        Ethernet
Disabled       Disconnected   Dedicated        Wi-Fi
Enabled        Connected      Dedicated        vEthernet (Ethernet)
Enabled        Connected      Dedicated        vEthernet (Default Switch)

 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 7 
============================ 
 
============================ 
Command: "netsh" "winsock reset" 
Description: "Resets Winsock." 
============================ 
 
 
 
============================ 
Running command: "netsh" "winsock reset" 
============================ 
 
The requested operation requires elevation (Run as administrator).

 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 8 
============================ 
 
============================ 
Command: "netsh" "int ip reset" 
Description: "Resets TCP/IP stack (IPv4)." 
============================ 
 
 
 
============================ 
Running command: "netsh" "int ip reset" 
============================ 
 
Resetting Compartment Forwarding, OK!
Resetting Compartment, OK!
Resetting Control Protocol, OK!
Resetting Echo Sequence Request, OK!
Resetting Global, OK!
Resetting Interface, failed.
The requested operation requires elevation (Run as administrator).
Resetting Anycast Address, OK!
Resetting Multicast Address, OK!
Resetting Unicast Address, OK!
Resetting Neighbor, OK!
Resetting Path, OK!
Resetting Potential, OK!
Resetting Prefix Policy, OK!
Resetting Proxy Neighbor, OK!
Resetting Route, OK!
Resetting Site Prefix, OK!
Resetting Subinterface, OK!
Resetting Wakeup Pattern, OK!
Resetting Resolve Neighbor, OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Restart the computer to complete this action.

 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 9 
============================ 
 
============================ 
Command: "netsh" "int ipv6 reset" 
Description: "Resets TCP/IP stack (IPv6)." 
============================ 
 
 
 
============================ 
Running command: "netsh" "int ipv6 reset" 
============================ 
 
Resetting Compartment Forwarding, OK!
Resetting Compartment, OK!
Resetting Control Protocol, OK!
Resetting Echo Sequence Request, OK!
Resetting Global, OK!
Resetting Interface, OK!
Resetting Anycast Address, OK!
Resetting Multicast Address, OK!
Resetting Unicast Address, OK!
Resetting Neighbor, OK!
Resetting Path, OK!
Resetting Potential, OK!
Resetting Prefix Policy, OK!
Resetting Proxy Neighbor, OK!
Resetting Route, OK!
Resetting Site Prefix, OK!
Resetting Subinterface, OK!
Resetting Wakeup Pattern, OK!
Resetting Resolve Neighbor, OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Restart the computer to complete this action.

 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 10 
============================ 
 
============================ 
Command: "netsh" "int ipv6 reset" 
Description: "Resets TCP/IP stack (IPv6)." 
============================ 
 
 
 
============================ 
Running command: "netsh" "int ipv6 reset" 
============================ 
 
Resetting Compartment Forwarding, OK!
Resetting Compartment, OK!
Resetting Control Protocol, OK!
Resetting Echo Sequence Request, OK!
Resetting Global, OK!
Resetting Interface, OK!
Resetting Anycast Address, OK!
Resetting Multicast Address, OK!
Resetting Unicast Address, OK!
Resetting Neighbor, OK!
Resetting Path, OK!
Resetting Potential, OK!
Resetting Prefix Policy, OK!
Resetting Proxy Neighbor, OK!
Resetting Route, OK!
Resetting Site Prefix, OK!
Resetting Subinterface, OK!
Resetting Wakeup Pattern, OK!
Resetting Resolve Neighbor, OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Restart the computer to complete this action.

 
=============== 
End of execution. 
=============== 
 
 
============================ 
Command: "netsh" "winsock reset" 
Description: "Resets Winsock." 
============================ 
 
 
 
============================ 
Running command: "netsh" "winsock reset" 
============================ 
 
The requested operation requires elevation (Run as administrator).

 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 10 
============================ 
 
============================ 
Command: "netsh" "int ipv6 reset" 
Description: "Resets TCP/IP stack (IPv6)." 
============================ 
 
 
 
============================ 
Running command: "netsh" "int ipv6 reset" 
============================ 
 
Resetting Compartment Forwarding, OK!
Resetting Compartment, OK!
Resetting Control Protocol, OK!
Resetting Echo Sequence Request, OK!
Resetting Global, OK!
Resetting Interface, OK!
Resetting Anycast Address, OK!
Resetting Multicast Address, OK!
Resetting Unicast Address, OK!
Resetting Neighbor, OK!
Resetting Path, OK!
Resetting Potential, OK!
Resetting Prefix Policy, OK!
Resetting Proxy Neighbor, OK!
Resetting Route, OK!
Resetting Site Prefix, OK!
Resetting Subinterface, OK!
Resetting Wakeup Pattern, OK!
Resetting Resolve Neighbor, OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Restart the computer to complete this action.

 
=============== 
End of execution. 
=============== 
 
 
============================ 
Command: "netsh" "winsock reset" 
Description: "Resets Winsock." 
============================ 
 
 
 
============================ 
Running command: "netsh" "winsock reset" 
============================ 
 
The requested operation requires elevation (Run as administrator).

 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 11 
============================ 
 
============================ 
Command: "netsh" "interface set interface name="Ethernet" admin=enable" 
Description: "Enables the Ethernet adapter." 
============================ 
 
 
Skipping command: "netsh" "interface set interface name="Ethernet" admin=enable" 
Command skipped. 
 
============================ 
Choice number chosen: 11 
============================ 
 
============================ 
Command: "netsh" "interface set interface name="Ethernet" admin=enable" 
Description: "Enables the Ethernet adapter." 
============================ 
 
 
 
============================ 
Running command: "netsh" "interface set interface name="Ethernet" admin=enable" 
============================ 
 
The requested operation requires elevation (Run as administrator).

 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 11 
============================ 
 
============================ 
Command: "netsh" "interface set interface name="Ethernet" admin=enable" 
Description: "Enables the Ethernet adapter." 
============================ 
 
 
 
============================ 
Running command: "netsh" "interface set interface name="Ethernet" admin=enable" 
============================ 
 
The requested operation requires elevation (Run as administrator).

 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 12 
============================ 
 
============================ 
Command: "netsh" "int ip reset" 
Description: "Resets TCP/IP stack (IPv4)." 
============================ 
 
 
 
============================ 
Running command: "netsh" "int ip reset" 
============================ 
 
Resetting Compartment Forwarding, OK!
Resetting Compartment, OK!
Resetting Control Protocol, OK!
Resetting Echo Sequence Request, OK!
Resetting Global, OK!
Resetting Interface, failed.
The requested operation requires elevation (Run as administrator).
Resetting Anycast Address, OK!
Resetting Multicast Address, OK!
Resetting Unicast Address, OK!
Resetting Neighbor, OK!
Resetting Path, OK!
Resetting Potential, OK!
Resetting Prefix Policy, OK!
Resetting Proxy Neighbor, OK!
Resetting Route, OK!
Resetting Site Prefix, OK!
Resetting Subinterface, OK!
Resetting Wakeup Pattern, OK!
Resetting Resolve Neighbor, OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Restart the computer to complete this action.

 
=============== 
End of execution. 
=============== 
 
 
============================ 
Command: "netsh" "int ipv6 reset" 
Description: "Resets TCP/IP stack (IPv6)." 
============================ 
 
 
 
============================ 
Running command: "netsh" "int ipv6 reset" 
============================ 
 
Resetting Compartment Forwarding, OK!
Resetting Compartment, OK!
Resetting Control Protocol, OK!
Resetting Echo Sequence Request, OK!
Resetting Global, OK!
Resetting Interface, OK!
Resetting Anycast Address, OK!
Resetting Multicast Address, OK!
Resetting Unicast Address, OK!
Resetting Neighbor, OK!
Resetting Path, OK!
Resetting Potential, OK!
Resetting Prefix Policy, OK!
Resetting Proxy Neighbor, OK!
Resetting Route, OK!
Resetting Site Prefix, OK!
Resetting Subinterface, OK!
Resetting Wakeup Pattern, OK!
Resetting Resolve Neighbor, OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , failed.
The requested operation requires elevation (Run as administrator).
Resetting , OK!
Resetting , OK!
Resetting , OK!
Resetting , OK!
Restart the computer to complete this action.

 
=============== 
End of execution. 
=============== 
 
 
============================ 
Command: "netsh" "winsock reset" 
Description: "Resets Winsock." 
============================ 
 
 
 
============================ 
Running command: "netsh" "winsock reset" 
============================ 
 
The requested operation requires elevation (Run as administrator).

 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 14 
============================ 
 
============================ 
Command: "ipconfig" "/all" 
Description: "Displays the current network configuration." 
============================ 
 
 
 
============================ 
Running command: "ipconfig" "/all" 
============================ 
 

Windows IP Configuration

   Host Name . . . . . . . . . . . . : DESKTOP-NRVEPHN
   Primary Dns Suffix  . . . . . . . : 
   Node Type . . . . . . . . . . . . : Hybrid
   IP Routing Enabled. . . . . . . . : No
   WINS Proxy Enabled. . . . . . . . : No

Ethernet adapter vEthernet (Ethernet):

   Connection-specific DNS Suffix  . : 
   Description . . . . . . . . . . . : Hyper-V Virtual Ethernet Adapter
   Physical Address. . . . . . . . . : 00-15-5D-FD-B1-66
   DHCP Enabled. . . . . . . . . . . : No
   Autoconfiguration Enabled . . . . : Yes
   Link-local IPv6 Address . . . . . : fe80::a412:8cbc:57bb:5b81%17(Preferred) 
   Autoconfiguration IPv4 Address. . : 169.254.72.108(Preferred) 
   Subnet Mask . . . . . . . . . . . : 255.255.0.0
   Default Gateway . . . . . . . . . : 
   DHCPv6 IAID . . . . . . . . . . . : 285218141
   DHCPv6 Client DUID. . . . . . . . : 00-01-00-01-2B-C0-74-8D-08-8F-C3-03-BE-8A
   DNS Servers . . . . . . . . . . . : fec0:0:0:ffff::1%1
                                       fec0:0:0:ffff::2%1
                                       fec0:0:0:ffff::3%1
   NetBIOS over Tcpip. . . . . . . . : Enabled

Ethernet adapter vEthernet (Default Switch):

   Connection-specific DNS Suffix  . : 
   Description . . . . . . . . . . . : Hyper-V Virtual Ethernet Adapter #2
   Physical Address. . . . . . . . . : 00-15-5D-9E-7F-C6
   DHCP Enabled. . . . . . . . . . . : No
   Autoconfiguration Enabled . . . . : Yes
   Link-local IPv6 Address . . . . . : fe80::fe95:3ddc:244:faf0%25(Preferred) 
   Autoconfiguration IPv4 Address. . : 169.254.248.171(Preferred) 
   Subnet Mask . . . . . . . . . . . : 255.255.0.0
   Default Gateway . . . . . . . . . : 
   DHCPv6 IAID . . . . . . . . . . . : 419435869
   DHCPv6 Client DUID. . . . . . . . : 00-01-00-01-2B-C0-74-8D-08-8F-C3-03-BE-8A
   DNS Servers . . . . . . . . . . . : fec0:0:0:ffff::1%1
                                       fec0:0:0:ffff::2%1
                                       fec0:0:0:ffff::3%1
   NetBIOS over Tcpip. . . . . . . . : Enabled

Ethernet adapter Ethernet:

   Connection-specific DNS Suffix  . : 
   Description . . . . . . . . . . . : Killer E2600 Gigabit Ethernet Controller
   Physical Address. . . . . . . . . : 08-8F-C3-03-BE-8A
   DHCP Enabled. . . . . . . . . . . : Yes
   Autoconfiguration Enabled . . . . : Yes
   IPv6 Address. . . . . . . . . . . : 2407:d000:b:aef1:eee9:529:26e3:4f14(Preferred) 
   Temporary IPv6 Address. . . . . . : 2407:d000:b:aef1:559a:7ed5:1ce9:1f6d(Deprecated) 
   Temporary IPv6 Address. . . . . . : 2407:d000:b:aef1:e456:56c9:2f2f:3621(Preferred) 
   Link-local IPv6 Address . . . . . : fe80::3e26:40a:1668:a2b1%11(Preferred) 
   IPv4 Address. . . . . . . . . . . : 192.168.18.232(Preferred) 
   Subnet Mask . . . . . . . . . . . : 255.255.255.0
   Lease Obtained. . . . . . . . . . : Friday, January 17, 2025 3:19:22 AM
   Lease Expires . . . . . . . . . . : Friday, January 17, 2025 4:19:24 AM
   Default Gateway . . . . . . . . . : fe80::1%11
                                       192.168.18.1
   DHCP Server . . . . . . . . . . . : 192.168.18.1
   DHCPv6 IAID . . . . . . . . . . . : 252219331
   DHCPv6 Client DUID. . . . . . . . : 00-01-00-01-2B-C0-74-8D-08-8F-C3-03-BE-8A
   DNS Servers . . . . . . . . . . . : ::ffff:127.0.2.2
                                       ::ffff:127.0.2.3
                                       127.0.2.2
                                       127.0.2.3
   NetBIOS over Tcpip. . . . . . . . : Enabled
 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 15 
============================ 
 
============================ 
Command: "wmic" "path win32_pnpentity get caption, driverversion" 
Description: "Checks for network driver updates." 
============================ 
 
 
 
============================ 
Running command: "wmic" "path win32_pnpentity get caption, driverversion" 
============================ 
 
wmic : Invalid GET Expression.
At line:1 char:11
+ & { try { wmic path win32_pnpentity get caption, driverversion 2>&1 | ...
+           ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    + CategoryInfo          : NotSpecified: (Invalid GET Expression.:String) [], RemoteException
    + FullyQualifiedErrorId : NativeCommandError
 

 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 16 
============================ 
 
============================ 
Command: "ipconfig" "/flushdns" 
Description: "Flushes and resets the contents of the DNS client resolver cache." 
============================ 
 
 
 
============================ 
Running command: "ipconfig" "/flushdns" 
============================ 
 

Windows IP Configuration

Successfully flushed the DNS Resolver Cache.
 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 16 
============================ 
 
============================ 
Choice number chosen: 17 
============================ 
 
============================ 
Command: "ipconfig" "/flushdns" 
Description: "Flushes and resets the contents of the DNS client resolver cache." 
============================ 
 
 
 
============================ 
Running command: "ipconfig" "/flushdns" 
============================ 
 

Windows IP Configuration

Successfully flushed the DNS Resolver Cache.
 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 18 
============================ 
 
============================ 
Command: "ping" "www.google.com" 
Description: "Pings the specified IP or domain." 
============================ 
 
 
 
============================ 
Running command: "ping" "www.google.com" 
============================ 
 

Pinging www.google.com [2404:6800:4009:801::2004] with 32 bytes of data:
Reply from 2404:6800:4009:801::2004: time=322ms 
Reply from 2404:6800:4009:801::2004: time=322ms 
Reply from 2404:6800:4009:801::2004: time=322ms 
Reply from 2404:6800:4009:801::2004: time=322ms 

Ping statistics for 2404:6800:4009:801::2004:
    Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
    Minimum = 322ms, Maximum = 322ms, Average = 322ms
 
=============== 
End of execution. 
=============== 
 
 
============================ 
Command: "ping" "youtube.com" 
Description: "Pings the specified IP or domain." 
============================ 
 
 
 
============================ 
Running command: "ping" "youtube.com" 
============================ 
 

Pinging youtube.com [2404:6800:4009:804::200e] with 32 bytes of data:
Reply from 2404:6800:4009:804::200e: time=323ms 
Reply from 2404:6800:4009:804::200e: time=323ms 
Reply from 2404:6800:4009:804::200e: time=324ms 
Reply from 2404:6800:4009:804::200e: time=324ms 

Ping statistics for 2404:6800:4009:804::200e:
    Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
    Minimum = 323ms, Maximum = 324ms, Average = 323ms
 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 1 
============================ 
 
============================ 
Command: "ipconfig" "/flushdns" 
Description: "Flushes and resets the contents of the DNS client resolver cache." 
============================ 
 
 
 
============================ 
Running command: "ipconfig" "/flushdns" 
============================ 
 

Windows IP Configuration

Successfully flushed the DNS Resolver Cache.
 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 2 
============================ 
 
============================ 
Command: "arp" "-d *" 
Description: "Clears the ARP cache." 
============================ 
 
 
 
============================ 
Running command: "arp" "-d *" 
============================ 
 
arp : The ARP entry deletion failed: The requested operation requires elevation.
At line:1 char:11
+ & { try { arp -d * 2>&1 | Tee-Object -FilePath temp_log.txt -Append;  ...
+           ~~~~~~~~~~~~~
    + CategoryInfo          : NotSpecified: (The ARP entry d...ires elevation.:String) [], RemoteException
    + FullyQualifiedErrorId : NativeCommandError
 

 
=============== 
End of execution. 
=============== 
 
 
============================ 
Choice number chosen: 19 
============================ 
Logging ended at 17-Jan-25  3:34:50.60 
 
============================ 
Choice number chosen: 19 
============================ 
Logging ended at 17-Jan-25  3:34:53.58 
 
============================ 
Command: "netsh" "winsock reset" 
Description: "Resets Winsock." 
============================ 
 
 
Skipping command: "netsh" "winsock reset" 
Command skipped. 
 
============================ 
Choice number chosen: 19 
============================ 
Logging ended at 17-Jan-25  3:34:59.74 
 
============================ 
Command: "netsh" "int ip reset" 
Description: "Resets TCP/IP stack (IPv4)." 
============================ 
 
 
Skipping command: "netsh" "int ip reset" 
Command skipped. 
 
============================ 
Choice number chosen: 19 
============================ 
Logging ended at 17-Jan-25  3:35:01.83 
 
============================ 
Command: "arp" "-d *" 
Description: "Clears the ARP cache." 
============================ 
 
 
Skipping command: "arp" "-d *" 
Command skipped. 
 
============================ 
Choice number chosen: 19 
============================ 
Logging ended at 17-Jan-25  3:35:02.41 
 
============================ 
Command: "ping" "www.google.com" 
Description: "Checks internet connectivity by pinging Google." 
============================ 
 
 
Skipping command: "ping" "www.google.com" 
Command skipped. 
 
============================ 
Choice number chosen: 19 
============================ 
Logging ended at 17-Jan-25  3:35:07.53 
 
============================ 
Choice number chosen: 19 
============================ 
Logging ended at 17-Jan-25  3:35:08.83 
 
============================ 
Choice number chosen: 19 
============================ 
Logging ended at 17-Jan-25  3:35:09.56 
 
============================ 
Choice number chosen: 19 
============================ 
Logging ended at 17-Jan-25  3:35:10.69 
 
============================ 
Choice number chosen: 19 
============================ 
Logging ended at 17-Jan-25  3:35:11.23 
 
============================ 
Choice number chosen: 19 
============================ 
Logging ended at 17-Jan-25  3:35:12.09 
Logging ended at 17-Jan-25  3:35:12.30 
Logging ended at 17-Jan-25  3:42:14.11 
Logging ended at 17-Jan-25  3:42:14.47 
Logging ended at 17-Jan-25  3:42:14.87 
